aided 9551
yellow 2934
del. 4745
four 199
woods 9497
resisted 7410
increase 705
granting 5313
eligible 1548
electricity 870
refunding 4065
lord 1599
sinking 8138
savaiko 9782
propane 6886
regional 2748
dell 4738
hdtv 9805
fur 9900
avondale 8769
bringing 5635
prize 2928
wooden 9676
wednesday 693
succession 5220
non-violent 7474
charter 4974
innopac 9133
infringed 4607
tired 2624
miller 5736
hanging 8924
merieux 8762
tires 6060
elegant 6638
second 743
earthquake-related 9319
available 1756
single-a 5801
errors 2572
cooking 7069
contributed 2022
fingers 6447
bonuses 781
fossil 9157
designing 2760
increasing 749
shocks 7604
specialist 2737
widget 5607
hero 2064
receivables 7641
reporter 5143
avery 8008
here 1727
atoms 9154
reported 83
china 1253
auctioned 4067
affiliated 8125
diagnostic 8148
buddy 6624
borrowers 4329
cyclical 4560
substance 193
elaborate 1361
climbed 1803
reports 1362
controversy 3179
military 2712
cancellation 5493
diplomat 7973
criticism 4149
golden 5980
projection 8713
owed 1853
explained 266
replace 4603
brought 1494
repurchase 7867
beneficiaries 1547
stern 6485
cocaine 8458
unit 100
opponents 4821
sexual 8071
cheating 2798
dna 6403
spoke 4619
music 2348
telegraph 2893
strike 2121
until 508
b.a.t 5982
cutbacks 1939
standardized 2871
mired 3836
relax 6598
successful 4181
brings 1750
holt 6440
hurt 3552
glass 4213
naczelnik 9670
hole 4479
hold 1778
circumstances 3355
corps 6511
morally 7506
locked 3630
pursue 1302
plunged 1792
rulings 6425
bernard 9110
coniston 6116
temperatures 9151
leaped 7798
revenues 3783
example 407
hydro-quebec 10
owes 7093
household 1081
organized 3324
currency 1692
caution 2768
reviewing 3422
want 1129
counseling 3439
unpaid 7956
complaining 4759
travel 4291
damage 2287
machine 1095
how 1730
hot 564
significance 2422
beauty 4960
outlawed 279
modest 177
raiders 8119
charleston 8480
sentencing 3459
outcry 3323
types 1438
effective 1305
wins 3996
attracts 894
headquarters 3525
cigarettes 105
menlo 9574
keeps 3683
democratic 1865
backdrop 6254
wine 3935
restriction 4839
welcomed 624
govern 8710
vary 422
barclays 5501
fidelity 5781
bread-and-butter 6396
ex-dividend 6243
californians 8782
fit 4217
fix 7112
striking 211
auditors 6473
deaver 9419
conner 9242
hidden 5924
easier 4031
undercut 3549
lambert 5852
slate 3097
effects 1907
schools 172
township 8837
undeveloped 8612
silver 6530
structural 3577
represents 3852
debut 3682
cftc 9116
crops 5372
arrow 9237
hoelzer 9932
financial 459
woes 8326
concord 8771
series 2603
commons 6792
contracting 8360
strips 8449
substantially 3285
laboratory 7008
ring 4461
whip 4938
waive 5979
freeze 8242
tax-loss 8516
mason 3163
semiconductor 3587
encourage 2984
millions 1879
strategist 7985
foundation 2917
md. 8682
assured 3211
noriega 4933
threatened 3178
surveys 8427
necessarily 3353
estimate 5947
mimic 7978
enormous 2139
bates 2215
shelves 7817
trecker 9998
flurry 7793
ups 9815
silicon 3603
ministries 9071
shipped 3988
musicians 7645
1970s 4311
r. 956
speeds 7039
nigel 6204
unfilled 1955
vitro 8627
channels 8106
wash 7539
chevron 7948
specially 7524
seizures 7624
carson 9306
basketball 9275
exchequer 6837
service 548
similarly 4978
lawsuits 1669
cooling 9494
legg 5580
needed 2427
master 2529
listed 1752
hypothetical 5623
bitter 5425
ranging 5825
listen 8398
rewards 881
collapse 5862
geneva 6000
predictably 5929
wisdom 3088
predictable 4543
defaulted 9195
stateswest 7802
showed 695
tree 4687
nations 249
project 1107
idle 7725
endure 9371
feeling 2353
acquisition 462
willingness 4872
boston 164
spectrum 6571
pigs 7521
craven 9983
resignations 8380
dozen 2010
affairs 1860
hub 6541
person 2338
rudolph 47
floating-rate 1633
recommended 3188
causing 91
absorbed 4484
amusing 2137
doors 4360
layoffs 8439
kremlin 7456
shipments 1470
committing 3369
shall 5191
object 6591
looming 4017
landmark 7223
mouth 9540
overcapacity 5866
letter 3175
entry 6874
retaining 3570
drought 5365
teller 8828
bradford 6554
singer 6627
chemistry 8055
episode 8719
antitrust 5655
professor 260
camp 6756
detectors 9848
hastings 7683
confederation 5304
saying 825
bomb 6348
meetings 656
times-stock 4810
gauge 3107
participate 5962
hungary 2278
orleans 4006
flowers 7325
headline 5440
than 80
accelerate 9018
rico 6457
bush 1524
touched 3096
rich 1818
pickens 4172
rice 2787
capel 6799
rica 8337
plate 2141
salespeople 9852
klein 4704
honda 7397
psychiatric 5062
lenders 5449
altogether 3911
tips 7067
volatility 4411
jaguar 3295
greens 8912
patch 6295
greene 7273
ldp 9644
three-year 4066
release 3673
saul 6106
respond 4131
leasing 3914
disaster 5390
fair 3521
peripheral 4347
niche 8094
transferred 7331
unexpectedly 7134
result 1260
fail 2563
resigned 453
sagan 9980
best 1294
pressured 2218
ambitions 2971
lots 6882
ackerman 5942
irs 3327
convex 9679
registration 4341
pressures 1989
score 2351
conceptual 8350
ira 7538
preserve 7593
wage 4816
never 2173
parallels 3105
extend 1662
nature 2842
rolled 3667
felony 3336
law-enforcement 8554
new-issue 8139
affiliates 3686
extent 4238
downgrade 5845
carbon 6497
debt 507
roller 9227
planner 4965
country 689
pits 9119
conclusions 9046
heating 2666
demanded 7185
erupted 6701
planned 2288
logic 3585
colgate-palmolive 8985
argue 236
adapted 1455
asked 1919
sohmer 8724
irresponsible 6714
caffeine-free 9975
pregnancy 8412
fema 9941
burton 7550
billing 5465
shouting 9292
holdings 1483
subsidy 9160
much 1123
stadium 2120
rubbermaid 9713
privilege 3326
gte 9000
pro 6731
doldrums 7828
life 2262
eastern 1240
worker 4462
irving 6476
irvine 6015
tumor-suppressor 8524
dave 6745
lift 518
chile 1719
child 2390
worked 191
spin 7878
diverted 9106
commerce 968
presidency 5295
employ 7773
disk-drive 7984
flooding 9152
k 8222
deferring 8595
surprises 6721
played 2116
stop-loss 9131
kohl 9734
player 2107
upscale 5415
anticipating 3262
violin 9809
specter 8995
trusted 8896
trustee 7643
hong 1616
taped 8464
things 2975
demands 5895
split 2957
elliott 1944
principals 4737
rebound 4569
european 1806
fairly 3865
tops 8559
marched 7101
reruns 2040
ownership 5622
tune 5141
midsized 5889
r.i. 3705
academic 2892
subpoena 9586
eagle 9766
corporate 585
opinions 3993
spurred 2727
capitol 4414
distribute 9398
terrorist 9638
financially 2273
birmingham 4713
falcon 7710
plight 4599
portrayed 3766
succeeding 3926
previous 1056
enters 86
politburo 8341
sciences 6695
ease 2776
had 432
ideal 6584
macdonald 4283
easy 1770
prison 3337
east 2738
hat 8477
deadly 8523
municipal 3513
elders 6533
survival 1082
disagreement 4963
possible 923
firmer 8015
possibly 2464
gridlock 9337
birth 8032
firmed 6227
shadow 8215
unique 2054
istat 9039
desire 5107
psychological 7943
bobby 8625
unix 7006
steps 3841
discovision 9946
attorney 2602
right 1485
old 29
creek 3942
crowd 4277
people 495
midyear 3596
crown 4251
consultants 2543
insistence 4837
fiduciary 7466
enemies 7234
chorus 8808
for 181
bottom 3032
fox 8530
p.m. 6134
contributing 2708
individuals 3352
summoned 3518
surging 7754
rep 9405
eduard 6662
24-hour 9120
personal-computer 8382
shifting 9171
defensive 5967
losing 3692
brokerage 4806
manufacturing 558
shaken 5511
marketers 5468
filipino 7594
dollars 1578
citizens 1283
annualized 5260
bankamerica 6863
lacked 4615
slightly 3241
nixon 4617
raised 1490
statements 6594
facility 3608
maxwell 1610
marshall 2585
soo 9894
son 4881
respectable 6468
beings 8783
magazines 3723
raises 3827
consumer-products 7518
reducing 1646
defendants 5897
fabric 7503
support 235
constantly 5608
one-time 3284
sheraton 9654
joseph 1229
authorized 2285
resulted 5031
call 2101
halls 2953
launching 7287
therefore 3862
underestimated 9763
offer 830
forming 8435
finnair 9074
survive 3725
incinerator 9309
nov. 38
inside 4223
maxicare 9614
devices 1073
vanguard 9168
jan. 3917
mighty 8567
panels 9473
azt 9582
<unk> 26
passenger 1058
adopt 6286
proved 5042
puerto 6456
steady 1572
disclosing 3368
proven 5590
proves 6761
exist 2542
accounting 2474
dealer 6828
negotiations 913
posting 4022
solicitation 4132
eventual 6796
floor 4402
actor 2315
flood 4399
pasadena 5403
role 1590
ambitious 1565
benefiting 9435
developers 6739
roll 1174
's 119
models 1434
ramada 9516
'd 3001
invested 1813
rolling 4762
'm 1815
explosions 9098
reorganization 843
kgb 6653
time 555
push 4010
measurements 8042
cincinnati 5048
chain 949
whoever 8230
theaters 2199
skiing 8176
chair 7139
midst 9107
venice 8916
burlington 8872
oversight 2567
prepaid 7191
revamping 7761
consolidation 7777
spate 8628
choice 1124
gloomy 721
drexel 5850
stays 4497
corp. 103
exact 996
aichi 9384
minute 1164
room 7858
bay-area 9972
fetal-tissue 3156
leave 1196
solved 1397
settle 1862
subway 9751
defaults 7726
team 168
depository 5236
speculation 3665
prevent 3035
findings 112
sigh 5775
southwestern 9232
prediction 8418
sign 381
shirts 3082
educate 9010
hewlett-packard 7037
jeopardy 5592
current 357
krasnoyarsk 9453
falling 2714
ground 2719
boost 1964
l.p. 3278
drafted 4952
jury 3095
understanding 2769
yards 9135
address 3866
alone 3515
dapuzzo 8950
along 600
benson 7671
passengers 6884
financiers 7213
redemption 3931
brilliant 2416
studied 149
funded 3169
commonly 8389
accomplished 6640
studies 3027
reclaim 5371
departures 5263
tasks 7399
love 6778
prefer 4966
ipo 11
logical 8120
bloody 4624
fake 7284
carol 8609
truly 7480
sky 5750
opposes 3212
working 1110
positive 2631
angry 3083
predictions 7678
tightly 7138
opposed 2553
wondering 8266
films 1316
scope 7275
theoretical 8159
prosecutor 3048
introducing 1311
afford 5823
apparent 6367
oregon 7535
thompson 7568
everywhere 4532
virtue 5569
riders 5344
behalf 2967
rebounding 5875
valued 3664
sorrell 9779
titanium 8091
originally 3981
abortion 2587
believes 1182
printing 6607
values 860
fresenius 9491
believed 1379
webster 7477
mentality 8870
n.y. 3732
unanticipated 6264
allowed 3071
monitoring 7695
winter 680
divided 4038
immune 5744
vancouver 8585
s. 4794
elephant 4922
coleman 2586
five-year 4073
minicomputers 8101
spot 2451
applications 3218
date 2312
such 256
acceptances 5245
data 1419
stress 2224
federal 498
natural 5052
sectors 2736
consequently 8715
yielding 427
ciba-geigy 8672
skf 9266
so 590
truce 2632
pulled 4662
nynex 7758
unsolicited 4852
transplants 3157
sell-off 6529
years 28
professors 6565
course 583
episodes 3689
experiments 8054
fasteners 5719
unfavorable 9680
tendency 7485
overhaul 7528
internationally 8996
lackluster 3242
jim 2644
troubles 3406
louisville 3707
attraction 6878
suspension 4656
troubled 903
decades 96
limbo 5412
instantly 9056
modestly 3249
thereby 6679
civilian 7964
matches 3139
subordinates 8401
nation 557
records 1052
h.h. 9562
drilling 7745
subscribers 807
subordinated 4123
matched 2806
fla 9624
shouted 8841
aluminum 8579
materialized 5406
hancock 8557
establishing 2269
bowling 8183
quarter 3315
repaired 4962
seldom 6887
square 3504
honduras 6308
revised 6023
sponsor 650
entering 2187
disasters 6360
prelude 8645
container 6564
pittston 7757
seriously 2915
investigation 1370
suggesting 7463
formula 4893
curbs 9629
million 468
seventh 2944
possibility 3834
quite 3717
lucrative 3390
besides 1154
remainder 2629
training 4331
kuwait 9288
programming 3790
wrong 2879
chevy 6763
gordon 5197
thurmond 8283
routes 6086
squibb 8491
saving 4273
reveals 8801
spoken 7131
clause 5290
one 247
reopen 4511
punishable 3335
spanish 5420
vote 4052
open 386
city 574
boren 8993
structured 5855
indicate 371
draft 7507
shoppers 8744
structures 4178
cite 1929
williams 4828
proving 5870
s.c. 6781
ridiculous 6655
slashed 7353
specialists 1805
photographic 4885
inventor 4986
dalkon 8425
conn. 856
depressed 3879
rival 732
coats 8745
future 677
glossy 6623
financings 5854
russia 8786
prospect 3668
addressing 1648
illness 5059
san 3394
sam 7625
royalties 7596
turned 920
argument 4584
alley 7215
sad 5646
prestigious 3199
say 674
buried 9033
financier 6105
allen 1450
turner 9341
borough 5492
saw 3267
sat 2909
fashionable 7285
aside 6709
instructed 4949
note 1142
goodman 2607
jefferson 2596
take 885
destroy 5601
mayer 3489
high-technology 1291
ironically 7556
tally 4589
altered 5015
opposite 6092
buffer 8265
knew 4868
israeli 7360
buffet 626
backlogs 1954
retrieve 7623
printed 3765
remarks 3457
house-passed 9246
inserted 5939
pages 789
honecker 9878
lawn 7111
neb. 7860
touchy 1281
average 339
phil 7499
drive 4232
occidental 6005
managing 1734
jitters 3621
axa 9700
wind 6699
refining 7930
jittery 8259
link 1141
mass. 217
salt 5342
liquidity 5625
laws 2855
madison 3646
surplus 724
senators 6757
lotus 8385
merit 1369
far-reaching 7849
bright 2450
steelmakers 6546
scarce 3973
aggressive 4111
slow 1359
liberation 2240
going 2005
equipped 3857
mcduffie 9807
index-arbitrage 4799
congressional 4056
dispute 3192
novels 9366
assistant 1387
awaiting 8518
prime 2203
resource 7787
erich 9259
artist 2329
middle-class 9166
borrow 7290
worried 890
roger 2528
liable 5908
worries 2919
where 284
vision 4485
espn 9593
corry 9632
responsive 5894
surgery 5938
aroused 7900
basir 9911
jumped 1814
sites 2706
bureau 794
affecting 5973
enjoys 7248
jobs 1426
last-minute 6865
marvin 4987
screen 2519
faded 2933
supermarket 3744
punts 16
spare 7261
jets 6931
spark 3358
abramson 7184
undermine 6580
concentrated 2725
oust 6130
many 1120
deduction 9652
s 9506
workplace 5020
expression 6104
allowance 9417
yearly 3784
underwriting 8073
bpca 9519
donoghue 367
comeback 5713
supervisor 9238
considers 5466
boat 9233
combines 3736
faberge 8971
teddy 4851
stretch 5856
west 216
locally 3575
artistic 8977
airlines 4244
concede 5830
hutton 1518
showtime 9505
combined 1346
cowboys 9825
prototype 1115
fujis 9657
wants 1398
enable 5778
chan 9908
thousand 5905
formed 3359
curbing 5733
centerpiece 6064
photos 2547
tightened 4791
former 49
polly 8935
consultant 2506
reebok 8820
polls 2112
engineering 488
policies 3069
pennzoil 7204
squeezed 655
situation 2561
constituency 7976
gintel 9896
engaged 4770
dubious 7228
spooked 5573
technology 1158
fame 8667
cost-sharing 6073
expenditures 4588
missiles 5679
wang 9415
threatens 5568
honeywell 8657
breakdown 2949
wires 5761
edged 5954
singapore 2186
boosted 1651
wpp 3803
cluett 6
allocation 5800
harris 1763
barber 6798
costa 8336
rain 6065
tracking 1005
ballooning 6869
vacant 5014
costs 774
sunnyvale 7033
trains 6506
minpeco 7182
summer 928
being 1162
rest 1613
recycled 3785
rubens 19
robins 9611
weekly 4534
temblor 8221
color 4151
competitiveness 8940
aspects 2151
around 911
sums 2140
unveil 6063
dark 2845
traffic 619
pop 3299
vacuum 8205
world 760
postal 6851
vague 4421
intel 6151
salinas 6337
discarded 4679
direct-mail 5467
offenders 3073
beverly 4610
satisfactory 1560
conditional 3829
lebanon 6336
tvs 8756
racial 8285
bergsma 8794
thinks 3994
scandals 6480
memories 1440
tube 4050
mccall 8662
exit 4518
ddb 3770
restoring 9032
refer 5940
unsuccessfully 1585
scientific 3184
power 966
intimate 8070
industrialized 223
leadership 4957
ratios 8026
standpoint 3748
thailand 1254
inflation-adjusted 6786
stone 4441
hopkins 5070
industry 489
favorite 2980
tumor 7602
five-cent 6500
neighbor 8915
act 527
johnston 7575
mean 2648
burning 9156
flawed 8946
image 2110
homeless 2337
parties 2147
accumulated 726
technically 5305
her 2073
philadelphia 3795
meals 5478
brazilian 6158
lang 9608
recommends 9124
emergence 8351
complete 475
saatchi 7561
lane 2316
survived 7307
mich 8151
elimination 4842
technologies 5763
with 87
buying 1655
abused 7120
pull 2743
rush 7749
october 687
monopoly 5570
abuses 9336
dependents 7526
politically 6467
agree 2588
detailed 3319
gone 2822
cnbc 9776
ab 9265
ad 740
ag 3821
ai 4239
certain 1520
doug 8565
am 6170
al 3980
watches 809
an 128
as 34
at 160
walks 8179
watched 1936
extract 9483
graduate 2733
tight 2520
summit 7437
trelleborg 9871
a$ 8601
congress 504
a. 163
gifts 3536
planners 1774
tricky 1156
norwood 9373
anticipates 1131
fraudulent 7896
mass 1737
nelson 2676
foreclosed 9539
original 3792
waiver 5981
sci 3311
consider 1988
caused 70
ceramic 5762
portraying 7821
tours 5150
restated 7694
fairness 3468
causes 5056
improperly 7305
hunting 9635
tv 2508
tw 9577
coda 7865
cheney 8278
to 64
nora 9862
midwest 3697
roadway 9325
case 1035
khmer 7599
calif. 3607
appointment 2171
returned 3025
hughes 8535
revolving 7931
soften 6821
condition 5421
highways 8503
cable 5124
accompanying 7936
venezuela 7362
laying 6357
joined 606
t. 259
sang 6629
sand 7160
adjust 8937
facsimile 8513
harry 6262
small 1319
mount 4733
kemper 8444
eurocom 9088
penalties 5024
paso 6195
hasbro 9897
past 1009
arnold 5730
pass 2619
investment 1623
franco 8102
richard 975
disruptions 7853
section 2808
gitano 8
prevailed 8860
scientists 1289
lower-than-expected 9170
method 7714
contrast 1969
full 762
installations 8960
lobbyist 4950
leaping 6889
hours 2197
citicorp 4995
concluding 8383
november 1681
backlash 7216
compliance 4766
experience 3939
prior 2950
periodic 9105
social 2169
action 1380
skepticism 5735
luck 3863
hart-scott-rodino 5665
tax-free 8646
via 1466
followed 615
enactment 7529
byrd 7859
noncallable 9199
pulls 4487
select 5323
eddington 9840
intensive 6805
attendance 4509
bankruptcy-court 8322
trips 7404
objectives 4231
petroleum 3894
pitching 6760
more 79
door 4015
initiated 3378
company 189
corrected 5040
competes 4980
tested 2259
foundations 3231
objections 7373
caci 9994
refinery 6527
keeping 2921
fatal 8904
science 2164
mall 9023
resources 314
morgan 4114
learn 4997
knocked 4400
male 2114
scramble 9126
beautiful 4012
mehl 6855
prompt 6583
stated 4026
calloway 4
suggestions 6712
accept 4700
states 2876
donating 8473
fiercely 7143
sense 2393
upjohn 6236
dress 7389
condemn 7959
huge 290
respective 8331
imminent 1976
hugo 6054
dismissed 3063
earnings 1003
plant 226
plans 745
plane 2481
waves 9029
ethics 3367
sens. 8994
acquisitions 4150
refuse 5525
resemble 6873
register 5402
broadcasting 5140
perception 3654
geographic 9653
replied 8542
mexican 2440
bowl 5832
fraser 6935
installed 3882
resorts 9346
attitude 2771
paper 180
scott 5746
replies 3787
broadway 9503
itt 6846
its 109
roots 7815
rapidly 4004
termed 6200
gerald 3360
wipe 8989
symptoms 92
ally 6916
tentatively 5795
guzman 9955
severely 8296
propose 5003
skipper 9930
magic 7765
speculate 3609
tro 9661
coping 9495
always 2134
courses 7188
repayment 1850
found 243
investigators 7119
status 1539
england 120
osaka 4784
reduce 1557
slowdown 1949
mackenzie 8587
finish 8596
measurement 3129
advertisers 739
operation 5210
nicaraguan 6300
really 2339
try 2784
aeroflot 9478
missed 5472
blacks 2960
research 151
fha 7721
ftc 5662
race 642
discounting 7519
occurs 5549
highway 3868
nervously 8969
belief 7879
risen 4559
1920s 1740
sparked 3456
qualify 4258
proxy 6593
imagine 4780
rises 400
director 37
owners 581
retained 3356
first-half 6138
castle 5419
arose 8702
major 1420
rooted 2061
slipped 3312
wilder 2582
thereafter 7642
number 198
sequester 7739
mid-october 765
kobe 6547
touting 7826
contended 7680
differ 4747
heads 1108
guest 612
jet 559
introduction 1064
moderately 5758
contra 6307
eidsmo 8086
calculations 1027
relationship 4623
seagram 7266
interviewed 3078
immediate 2945
appreciation 4593
crop 5366
focusing 4155
unprofitable 7705
rampant 8812
grace 447
iranian 9230
yetnikoff 7245
computer-guided 8332
minimize 6898
determined 998
marriage 6998
refrigerators 9749
belli 9933
fights 2513
luzon 9025
sell 1771
jeopardize 7636
reliance 5867
also 840
recognizing 2047
internal 842
mengistu 9833
play 1811
swiftly 4879
staffers 7390
anti-takeover 3922
unused 8753
peripherals 9414
brooklyn 3731
plan 738
accepting 3535
chancery 8298
singled 6144
understands 5930
toronto-based 2305
omaha 8634
tpa 8514
seize 5554
sometimes 2148
cover 3590
toseland 9172
barred 3837
bodies 8182
barrel 2664
attacking 4528
masson 9464
golf 6733
gold 51
midwestern 5367
defended 2839
bookings 9641
nasdaq 1200
session 4392
freight 7387
entity 6250
coins 9492
murata 9695
pleaded 2828
indicator 390
laurence 6566
writes 8275
stockholders 1188
failed 1884
wayne 3478
olivetti 9735
equity 865
cuba 9429
bernstein 4549
columns 5158
giants 597
financial-services 6126
dependent 8356
banned 632
remedy 9462
ninth 2794
closely 192
reporters 5161
rafale 9834
enemy 7504
cry 2659
banking 943
coors 3775
banponce 9850
river 2281
prospectus 9067
rumored 5284
set 1029
carrying 2635
activists 7472
instituted 1304
potent 7637
sex 2252
see 1817
sec 1159
sea 3811
sen 7597
institutes 3177
regulator 7887
# 4809
spirits 5751
negotiator 1391
guinea 1731
currently 426
diluted 6209
rejecting 8497
pickup 6764
europe 1825
cabrera 9956
premises 4507
brewing 7045
incident 3086
death 2952
dividend 1575
delivering 1987
legislature 5358
prospects 1119
last 710
influential 1589
barely 6022
warner-lambert 9987
connection 4731
improves 4189
scams 6472
long-term 1810
poverty 5074
approve 3263
messiah 7313
load 1569
drunk 5442
loan 3150
community 3567
agents 4765
church 4442
improvement 1997
sherwin 3481
belt 589
publishing 45
surged 1694
acceptance 4829
hitting 4390
widening 7676
firm 1106
champion 5584
nabisco 7825
fire 3538
mine 6182
fund 346
races 6458
representative 1262
insiders 4866
towns 562
handling 1166
uncertain 8186
judicial 3386
straight 2524
expanded 3791
budget 2715
receive 1189
pressed 3814
evaluating 3089
error 5049
mlx 14
robin 7831
styles 4287
pound 4937
hoping 7401
templeton 9981
backing 5681
averaging 8705
von 8956
owen 7669
motors 5238
ducks 9855
centennial 1399
triple 1712
coca-cola 4167
chase 2027
funny 2063
barney 1762
phelps 7795
fibers 255
savings-and-loan 4352
mint 8330
shorter 379
rules 2131
virtually 274
resulting 3633
d.c. 3492
flooded 3700
comprehensive 2790
alert 6332
mosbacher 7588
levels 1831
medicaid 7764
necessity 8913
tobacco 2184
recent 399
alleging 3411
picks 5603
concrete 4969
zoete 8123
grower 6154
ltd. 464
kelly 8558
clearance 6109
r.h. 8822
responsible 5476
plagued 6292
amr 6237
defenders 9262
readers 6962
reap 5514
admission 9465
advertisements 2604
daewoo 8919
signals 1934
eager 3019
high-interest 7851
parents 2817
location 5253
sydney 5997
input 8740
surprised 4118
lumpur 2205
australia 1488
victims 2614
emergency 6185
format 3143
couple 3397
bureaucrat 9369
wives 618
suffering 3183
baskets 5512
aerospace 1663
fractionally 4083
entrenched 5538
projects 2905
formal 3898
equities 6534
imposed 271
d 7868
dai-ichi 5814
consensus 4865
communications 3569
imposes 5316
yields 325
ivan 9563
collective 5774
privately 3168
concedes 3049
methods 4475
senate 526
spring 1273
b. 759
bounce 4958
palm 6741
pall 6373
sight 4088
hard-line 6668
tisch 9594
pale 8851
amicable 6201
transactions 3331
52-week 1576
prosecuted 2824
dating 3379
temple 3815
be 220
agreement 1309
andreas 9934
nowhere 4621
santa 3605
relating 3384
by 229
wildlife 9053
zip 6089
anything 1729
deserves 8885
stuart 4763
repair 4889
clinton 9764
colorado 1219
garbage 3727
into 289
conceded 8105
appropriate 3599
primarily 1203
repaid 1854
guideline 9793
uncertainties 5886
criticisms 8908
span 9367
spending 750
apartments 9164
bargaining 6918
submit 3377
custom 5337
crackdown 4638
suit 3423
opens 4860
blueprint 8353
considerably 3688
atlantis 9790
elsewhere 4143
inches 3880
jewish 8726
oils 2297
slump 3909
inched 1057
deductions 7525
atlantic 3565
pacific 457
line 2266
considerable 3743
posted 1213
cia 6346
refinancing 7850
cie 7927
redeemed 3306
up 95
us 214
maturity 359
customers 979
mature 1781
apiece 3819
alarm 7014
boomers 2029
armstrong 6975
defined 4712
likewise 7329
start-up 5950
multimillion-dollar 7312
influence 2709
u.s.a 5235
diverse 6038
billion-dollar 5932
codes 9687
edwards 5669
permissible 6160
preventing 3432
post-crash 8438
definitely 6110
actors 9080
revision 7751
elements 6642
titles 7084
energetic 2454
provided 1993
prosecution 3487
robots 6723
businessland 9570
lufthansa 9841
kaiser 9708
worm 9658
reinsurance 8690
sides 2030
mood 6539
ago 81
tailored 4335
land 2665
fighter 8571
emigration 8703
mailing 4043
age 1155
walked 6762
beverage 4981
came 1234
franchisers 9470
walker 6002
fresh 2694
having 137
code 1666
partial 6572
illustrates 5328
sr. 8680
broaden 5461
results 116
existing 4393
illustrated 6637
softer 5951
stops 9082
broader 1789
centers 2191
seemed 878
26-week 7910
longstanding 3899
harvest 6518
concerned 1354
young 2160
send 4350
citing 3340
allied-signal 9545
dislike 5571
hints 8269
sent 3348
retire 7566
garden 8174
straszheim 8890
continues 358
reopened 4397
mcalpine 1551
animals 6622
continued 329
minerals 7183
categories 1540
timely 4750
sen. 3869
real-estate 3258
pro-choice 2554
transmission 7060
experiencing 5888
whooping 9250
fewer 1183
anxious 4180
threat 1345
trudeau 3408
reich 6634
leaseway 9102
adm. 9642
pledge 7663
licensed 4148
video 2457
licenses 6167
assembly 6266
dynamics 2601
odd 2013
victor 613
index 1890
lehman 1517
expressed 4410
richmond 4021
consistently 5430
indian 6730
turnaround 4887
flowing 7102
firms 1292
equivalent 3511
publications 3566
proliferation 9537
led 167
lee 2785
leg 7276
respectively 6859
gathered 8428
leo 4395
busy 8130
let 4434
consideration 3204
invented 4468
parkway 9686
great 2222
engage 5496
uneasy 8704
technical 1848
involved 2658
casino 5535
fetch 7881
survey 1888
insulin 7920
defeat 2127
opinion 3443
residents 7135
makes 104
maker 542
involves 3416
holmes 9385
foreign-exchange 6900
tools 3117
standing 673
confidence 4364
cheered 9011
property\/casualty 6057
certificate 3059
illegal 962
ministers 2746
next 528
doubt 3087
face-to-face 6719
doubling 8941
midday 6754
rick 3140
pencil 5813
bronfman 7214
occurred 4648
dealings 5433
federally 3170
sharply 709
baby 2028
roller-coaster 9225
pieces 3737
charity 8484
customer 3330
mid-1970s 4304
balls 2119
practicing 3762
retreated 9424
this 56
bally 8879
challenge 1018
clients 1598
insists 2564
pour 412
emerson 9785
thin 3990
drill 7991
fulfill 7252
wedge 7036
slid 445
weaker 6067
pawn 9756
process 295
lock 3669
slim 9575
rode 7542
purposes 5336
promotional 4332
high 71
slip 1927
reynolds 6984
bolstered 5972
weaken 4586
educational 2969
destroying 8779
reuter 6184
delay 4366
crandall 9740
animal 7291
comedy 9090
establishment 5475
blocks 4676
indicating 5807
tied 1096
halted 5563
lama 6193
fits 2691
ties 2125
tariffs 7454
solidarity 2158
efficiently 8388
realized 3090
boeing 2461
manpower 5044
antibody 9732
counter 4801
robot 8784
element 4595
commodities 4225
acquitted 9428
asserts 5352
intellectuals 7341
equity-purchase 5806
counted 7047
houston 5013
reversal 5975
producer 1542
produces 6268
move 831
doubtful 8035
produced 1526
directs 6669
year-earlier 3317
warren 3933
perfect 7646
mitsui 4092
chosen 2988
meantime 7055
thieves 6479
degrees 1277
stalled 7837
communication 3104
derivative 6048
physicians 8223
designs 7416
outlined 7469
bat 2118
disrupted 8371
legendary 6735
realize 4339
presidential 2492
installment 4257
undertaking 2234
a.p. 9870
merge 3254
truth 2557
shortage 2016
accounts 1960
beneath 9554
suitors 6437
doing 799
societe 7926
society 1914
frequency 4537
agriculture 4437
witness 3343
fundamentally 5621
' 360
dismissal 2973
evacuation 8309
highs 5984
burke 8092
troop 2781
shut 4416
await 7161
hyundai 7562
greedy 5542
regulators 1711
surely 5644
regulatory 473
demler 8333
steering 8414
sansui 8936
spill 9054
dubbed 5137
gallons 9226
could 623
david 1389
length 4620
notebook 7063
removing 5045
davis 4752
scare 7345
vickers 9696
relocation 8741
scene 7583
owned 228
hertz 9035
owner 3979
mandatory 6818
buoyed 3625
nyse 6399
legislative 2620
vetoed 6965
deceptive 2576
courter 2645
ordering 4639
detailing 8063
system 820
state-controlled 7883
norton 9297
behaved 7105
painful 8088
interests 486
enforcement 1297
vigorous 8175
lot 2031
rockwell 4845
ingersoll 9612
amsterdam 5989
fleischmann 9880
elite 2958
haven 855
steel 602
colleagues 2838
bother 8415
reacted 5207
extraordinarily 7509
roberts 8142
appealing 993
briefing 4164
pertussis 9252
steep 2701
steer 6885
iron 8129
collecting 1022
false 7760
partnership 5934
gently 9324
reassuring 6442
tonight 8132
natural-gas 6218
defending 5521
blockbuster 7257
clearly 1206
viewed 2419
prohibits 3434
documents 1100
bacterium 9215
studying 2991
mills 8187
mechanism 3223
cross-border 6319
seidman 7747
equaling 6001
linda 2940
korean 6849
lipton 7788
soap 8274
soar 7796
worldwide 7559
lancaster 4077
allow 1465
foreign-currency 8113
delayed 6526
altman 8827
visa 5473
device 3830
segment 4281
so-called 1258
placement 5121
stronger 389
program-trading 4412
mechanical 487
painting 2294
fact 908
atmosphere 6173
assassinations 9334
terminate 8562
vacancy 6418
bring 125
bikes 8083
lloyd 4174
rouge 7600
rough 2408
economist 1913
brink 8234
decade 2721
principal 1396
jay 3634
should 238
jan 6687
entities 8005
jal 9966
planted 6349
tape 7024
printers 5572
riding 6542
bourbon 9758
secretaries 7109
hope 1033
meant 3014
insight 3635
advisory 3147
bonds 503
succeeded 5271
lucky 4531
prohibition 7846
autos 3888
exchanges 4649
shaping 4914
aer 1
committees 4438
a.c. 3703
wilmington 6430
taxes 522
stuff 5189
ohio 491
rein 8359
strengthened 5383
temporarily 1693
catastrophic 7762
frame 8090
edition 5050
subcommittee 4374
bidders 838
bofors 9992
packed 3524
wire 8508
nationwide 4466
nuclear 965
ends 2406
explosive 1431
negotiated 4855
lawsuit 3420
restrictions 3444
figured 6897
drum 7189
invited 7027
recorders 8158
deficits 7589
drug 3351
etc 6631
tripled 2699
figures 691
lavelle 9425
invites 7564
boyer 7916
adjusted 1905
co 1629
conclude 5190
ca 2289
near-term 7666
cd 6853
incest 2599
personal-injury 9747
adjuster 9313
cs 5844
allocated 3824
labor 714
outsider 8695
midland 5502
quotas 2021
genetic 6674
poured 291
hottest 664
waste 2652
louisiana 3115
trinity 6576
antar 9349
dresdner 8604
homosexual 3453
c. 3151
c$ 1580
accident 6259
graphics 6143
atlanta 1463
spain 1334
laser 4192
sotheby 5685
tremor 9876
runway 9832
eaton 4094
expiration 8768
tharp 9889
deductible 8644
va 8914
omni 8211
registered 684
delaying 7842
surprisingly 3767
laundering 8510
hardware 1233
optimistic 7415
sits 8387
hubbard 4604
microsystems 7031
ariz. 4343
terrorism 7453
dallas-based 7904
ball 2117
columbia 3655
mcgovern 5198
drink 2036
upon 3932
nationally 8979
v. 5334
forecasts 867
infiniti 7425
dust 299
afghan 8962
expand 592
audit 814
off 560
indonesia 2741
patterns 1910
command 3969
diversify 1777
audio 8874
drawing 1683
newest 6097
restructure 4102
softening 6217
less 917
moments 5427
rooms 8393
predicts 5697
day-to-day 6026
paul 1449
lesk 9813
merksamer 9508
generous 6179
developing-country 9648
stoltzman 6610
residential 1917
gum 9726
arrest 4873
combine 5779
cosmetics 7283
crack 2372
enfield 7209
increased 708
government 499
checking 4253
chancellor 6836
rubin 8552
fuji 2472
haul 3778
five 200
desk 7017
belgium 6675
trash 5933
finnish 6278
chairs 4994
accelerating 9356
garage 1423
become 751
replacement 4846
amendment 5133
gaining 802
indications 5251
liquidation 6194
guaranty 8470
foreseeable 6651
thief 6727
choosing 5317
loaded 4685
ballot 5675
recognition 1347
contested 9916
sufficiently 5630
literally 7229
avoid 3053
emhart 9390
slipping 9104
salaries 3387
demonstrators 4626
does 250
passion 4492
high-definition 9804
fazio 9789
deciding 6883
integrate 7572
schedule 4059
picop 9874
pressure 2864
accompanied 6643
loans 2272
vs. 4594
stage 2505
gained 3248
sister 6955
puts 4705
debentures 2301
angeles 3648
union 1847
seeds 6683
insufficient 8349
warner 758
revise 8735
massachusetts 3255
alliance 4236
letters 3347
commitment 2108
assess 6427
lung 207
roads 8963
merc 4379
banco 9040
mere 704
negotiable 5242
terminated 2279
stocks 1709
housing 5078
spots 7577
peters 6355
restricts 2208
bros. 7236
frustration 7741
troubling 9147
gut 5265
pretax 3281
naturally 6685
function 7616
building 1903
delivery 1992
lowered 766
valuation 1145
basin 4944
mcnamee 8819
count 4202
evident 4634
deficiency 8155
official 639
smooth 254
reinforcement 9926
imbalances 1931
excitement 7492
placed 1276
convince 5226
nancy 2814
problem 127
bearing 322
irish 9727
nurses 8251
recognize 317
contribute 5613
rubble 9315
slowing 1975
iverson 9378
consumed 7591
guy 5642
ink 7729
walters 3893
compared 1055
variety 4924
trials 3485
lately 4833
compares 4815
details 1137
bond-equivalent 7992
illusion 8214
reckless 6575
francisco 3395
monday 405
outlets 4982
chance 4042
repeal 7684
exposure 1826
searches 7563
spokesmen 7320
lasted 2633
rule 1037
aetna 8835
hedges 8821
compete 1177
pension 5225
searched 5987
rural 4439
tax-exempt 7317
gardens 9240
inning 8856
searle 8551
surrounding 5614
consolidated 50
magnetic 5759
doubts 5724
desirable 2783
coopers 8066
controversial 4188
mansion 9869
oldest 3598
saved 5370
relationships 7249
votes 6342
voter 8281
edward 4423
voted 524
worth 854
blanket 7816
vinson 9744
sellers 5600
manic 9209
mania 1739
jacob 4333
exporters 6505
postpone 6708
tickets 5477
pachinko 9806
contemplated 7994
investigator 7337
spacecraft 9877
monsanto 6691
announced 734
cms 8934
pilson 8375
jamaica 4942
phones 9210
horn 9345
machines 648
established 4608
settlement 4727
london-based 3279
above 1695
toll 5879
officially 3719
consisting 5518
told 3005
crunch 4515
simultaneously 5077
conglomerate 59
protection 269
pursuit 7805
celebration 7812
obtained 3381
watchers 4563
daughter 7127
items 2006
employees 2152
smoke 2185
stressed 1874
postponed 4055
wyss 9064
secure 6808
peabody 5509
highly 2357
neutrons 5772
thrust 8728
fournier 9391
cane 6169
opportunities 5615
cathcart 9022
total 205
plot 2060
palestinian 2239
indians 7478
negative 2484
afterward 6968
1930s 6684
indiana 662
hahn 4849
scary 9144
giovanni 6945
award 8495
aware 150
mather 3802
unraveled 6930
tariff 1537
blocking 6923
word 2805
wore 7385
permits 6522
crest 8679
work 323
refusing 8490
theories 7635
era 2501
workstations 9359
indicated 1889
psyllium 8668
cited 4119
bennett 5272
india 1255
fax 3800
indicates 2210
ual 5558
cites 3657
totaled 791
recovery 5698
carriers 4988
provide 1932
song 7364
crusaders 9836
infringement 9019
ig 8115
interview 1126
ordinary 5145
resignation 3057
gamble 7186
pizza 8193
fever 8018
after 424
damaged 3233
lab 2903
customs 8290
lay 3910
suing 2654
strategists 9175
law 1265
meaningful 3015
las 5479
flat-rolled 9544
pemex 9958
homeowners 7193
appreciate 7656
stimulate 7618
supermarkets 8982
green 2994
fan 5817
order 988
greed 5105
salon 3963
cumulative 8256
office 1393
devote 2628
consent 4129
satisfied 7527
innovative 6072
japan 1041
mayor 607
somewhere 6929
recreational 6787
christie 5682
denver 7861
production 1487
violetta 9675
harmony 2105
then 532
them 668
affected 7479
bans 2198
safe 4254
break 5695
band 4453
bang 4516
they 374
bank 1624
bread 6499
brouwer 9328
rocky 8791
reasonably 6028
classified 257
backgrounds 6100
rocks 7427
reasonable 8681
feeds 6513
entitled 4527
carlos 1392
lifted 505
schemes 5838
crimes 7371
doomed 6665
slew 4300
burnham 5851
network 3685
cameras 7498
diesel 6783
gnp 7752
vessels 7333
daniel 951
unicorp 6206
medicine 122
hooker 9511
forth 7638
sliding 4562
disputed 1014
barrier 3962
sharon 7767
veto 4912
standard 252
campaigns 2486
appointments 5312
disputes 715
pro-democracy 4625
certified 3349
recovering 5494
created 2605
creates 5731
festival 9677
renew 3709
oppose 3161
incorporated 1676
bologna 8149
boiler 9770
abolish 6832
maidenform 9811
another 649
comic 7159
electronic 806
illustrate 6644
timothy 8776
rated 5791
hedging 6101
takeovers 7195
approximately 3823
rates 338
haas 9606
john 861
dogs 2037
damaging 5636
190-point 5507
ted 7869
diversified 4898
albert 4144
rejected 264
bailout 7046
cereal 6498
wasted 5327
nahb 15
toronto 465
guild 3409
target 720
n.h. 859
citibank 5503
scenes 2444
hollander 7081
merck 9893
historical 2421
solely 2291
minus 3553
pervasive 7121
rewrite 5307
madrid 9678
manner 4577
forced 4009
strength 1957
genuine 1279
widen 8368
convenient 4250
latter 6383
seymour 1092
indexes 6103
morristown 8314
subjects 3031
luxury 5490
forces 1642
explanation 8192
unsecured 5240
circles 6703
acquire 848
bruce 7377
hammond 4458
sue 5354
exercised 4044
extending 5359
involving 1036
germany 2801
scripts 5185
phase 3597
assessed 5910
germans 2424
intergroup 7206
neighborhoods 2959
incomplete 2571
calculated 5999
newcomers 6966
sandinista 6309
accounted 5495
deeply 4646
voting 1478
notion 2053
reserve 1924
d. 451
anti-abortion 3191
lewis 4362
greenville 2795
exclusivity 8301
enjoyed 5268
painfully 7098
sentence 6464
glasnost 6661
pursuing 7302
adequate 5068
predecessor 2946
do 1153
di 7179
dd 6205
de 2590
preferred 1482
yielded 3978
watson 3047
quotron 8365
nasty 2539
du 598
runs 1757
covering 5027
exchanged 6784
lexington 8204
ems 8633
equivalents 5684
analytical 7952
implication 4742
steal 3965
roberti 8749
secretary 1388
observes 8750
w. 4571
observed 4539
depends 6372
projections 6553
cattle 5387
discussions 2466
techniques 3594
draws 4923
away 661
afloat 8737
sweden 5808
rushing 8539
unable 5085
tainted 9352
cooperation 2688
drawn 4520
co. 231
we 130
terms 1187
wo 3166
handful 3774
packaged 7187
clues 1937
convertible 1481
packages 4262
downgraded 5860
kitchen 8207
received 980
climate 3229
cox 9224
ill 3890
ncaa 9273
acadia 8324
receives 3329
receiver 8209
exceeds 6052
requests 4751
disappears 4478
old-fashioned 5545
department-store 8652
con 9712
negotiation 6922
year-end 477
tone 2515
royal 463
seizure 9350
tons 4935
tony 6192
southam 9296
telecommunications 2750
speak 4524
cities\/abc 8373
nomura 5961
buffett 9260
creatures 8790
sachs 1627
flexible 7801
dozens 3346
duties 4247
families 5115
innocent 7158
attacked 8216
baum 5201
concerning 7709
bnl 7465
ogilvy 3801
applied 1199
physician 8249
inhibit 5673
has 69
ahead 2480
publicly 1705
air 3687
aim 4076
abrupt 5262
misses 8411
aid 1307
property 1272
launched 1409
mistake 3029
schaeffer 9167
dumped 285
tissue 3158
world-wide 430
conn 858
wooing 5634
confirmed 2257
perform 5303
demonstration 7493
jerry 4130
incorrectly 9024
quebecor 8544
indictment 3477
convictions 8297
bunny 2039
independent 847
nih 3201
posed 7194
blames 5727
hang 4985
counterparts 1445
hand 1214
norwegian 2085
blamed 2017
prescribed 7848
vermont 261
kept 3628
scenario 1135
supervisors 7555
warburg 8954
hispanic 7278
client 2432
thi 9909
the 32
camps 8803
musical 6619
epa 8051
unified 7314
quoted 2681
athletic 4290
photo 8746
quotes 8056
thanks 5192
victim 3388
electronically 8002
adding 3050
comparisons 7457
hills 1264
cornell 9520
fared 3274
weiss 8433
passive 7476
wright 5072
belongs 1873
transformed 5581
board 33
marginal 8676
fares 9264
expelled 4715
freeport-mcmoran 6246
arab 8636
boxes 7784
unification 7310
campeau 5869
ginnie 6046
designers 4992
retreat 7339
disadvantage 5877
eroded 9600
tendered 6136
a.g. 7043
trinova 9213
securities 437
gandhi 7473
night 2378
security 2777
cooled 5760
jean 8880
sends 5188
alice 7068
born 6455
productions 3417
bork 9976
confusing 8533
denies 2600
humor 7029
comments 3452
asking 2238
denied 1534
beating 7558
participation 4661
columbus 5721
marketing 538
pose 1337
illustration 7484
graduates 4686
restructuring 1595
plc 53
architectural 4219
plo 2244
flaws 8068
post 742
nev. 5481
properties 140
gartner 5195
jurors 9745
theirs 6926
newspapers 3033
months 790
banker 4317
horizon 6982
considerations 8294
dilemma 4862
pays 6800
float 7169
profession 2800
beneficial 5926
prisoner 8895
unilever 8968
capped 1722
gutfreund 9986
balanced 4536
zero-coupon 8600
legislation 517
liquidated 6251
fight 519
conservation 7544
way 882
accords 8572
editions 1679
was 54
war 1880
lowest 2908
sagging 4368
widens 8136
northrop 9377
becoming 2183
peninsula 4976
elderly 4280
true 876
reset 7168
responding 3839
high-quality 4902
reproductive 6694
maximum 4404
sinyard 8078
crystal 5771
cancers 6409
mtm 8755
emotional 5438
promises 4993
medication 9528
moore 4266
computing 1408
request 921
flaw 8959
evidence 1983
expertise 8059
promised 5041
face 1172
distributions 8255
physical 4469
weakened 6804
stake 1479
topped 6044
reality 2062
negotiators 1284
calgary-based 8583
interested 3023
holding 470
test 2791
unwilling 5043
hoffman 1341
artificially 8717
scored 8858
human-rights 6670
brothers 5586
theatrical 9689
welcome 4664
convincing 7977
update 7522
complains 5582
scores 2858
overbuilt 9538
mullins 7056
balloon 6392
pork-barrel 7732
ogden 7950
flag 2591
together 1480
loyal 4328
videocassette 1364
reception 7775
n.j. 3479
lineup 9597
precedent 1034
stick 6231
concept 1150
switched 4306
write-off 6284
global 1822
switches 9513
known 2707
supplement 8545
battle 2584
creative 6609
devoted 4162
repression 8712
certainly 2174
killings 4642
zone 2122
midler 8621
refcorp 9720
compensate 2267
permanently 9771
southwest 9204
brown 3490
charles 1713
seemingly 6920
liability 5913
automobiles 3844
vegas 5480
microprocessors 6153
10-year 3663
trouble 2954
blast 6892
aggressively 3611
perceived 3950
presented 2435
turns 2391
fragile 1163
gun 9358
earmarked 8487
cray-3 1111
sidewalk 2332
greenhouse 6689
upper 6510
revolution 2441
regret 2146
regained 8699
discover 7394
cost 764
cargo 3861
purchasers 1654
appear 117
assistance 2702
salmonella 9964
shares 930
uniform 6743
leval 9460
shared 6573
appeal 4002
satisfy 7590
collateral 5237
explosion 1738
cos. 6190
genes 3234
rubicam 3804
teaches 4972
appears 219
change 1968
sending 3383
exemption 4926
trial 3055
franklin 8127
edisto 8257
kemp 7730
usually 2096
montreal 8040
retired 953
extra 2902
lending 5252
marked 7674
bullock 8824
markey 4424
fbi 6347
rarely 3341
mobil 9134
market 392
angelo 3968
terminal 7023
prove 584
prompting 8656
fairfield 7971
live 4459
merabank 9777
angels 4446
marginally 5418
commissioner 6737
abrams 9109
cie. 7924
club 1427
minimum-wage 6370
clue 6981
nguyen 9907
fixed 1748
commissioned 8185
cfcs 8048
organizations 2245
ibm 1454
car 3856
cap 6070
cat 3110
decker 9389
labeled 5515
incidents 7692
can 383
metal 5969
trans 5489
pretoria 6331
fulton 5233
heart 3038
dedicated 7870
rebuffed 4103
p&g 8673
december 3458
chip 1157
1980s 2931
heard 136
fortunes 6293
chicago-based 7374
yard 9220
exclude 7253
handle 1991
clothing 6050
occur 1192
productive 7405
morgenzon 9954
bankrupt 6487
dialysis 9489
fortunately 9161
discussion 6322
means 2512
write 6219
multibillion-dollar 2280
familiar 3081
dominance 2763
economy 701
product 1432
sacrifice 5624
southern 1509
produce 1079
impeachment 9816
commit 4614
drastic 6165
heroes 6738
nomination 5315
lifting 4824
goal 4230
eurodollars 5247
remember 2646
whenever 6483
futures 4382
explicit 8400
ordinance 9300
accelerated 1266
laff 9607
kurt 8926
typical 5244
no. 3514
serving 2955
indeed 3022
displayed 8674
consulting 1596
ended 352
fund-raising 9427
stayed 6021
statistical 8293
cold 4853
still 646
birds 5001
restructurings 6391
acknowledge 4663
reacting 7445
forms 2804
window 4221
norway 6932
rorer 9892
halt 4037
barron 6137
rake 17
introduce 736
col. 8659
wealthy 4605
not 566
now 145
provision 1371
discuss 2747
nor 147
enacted 4826
commuters 9645
lies 7731
james 162
drop 792
bursts 9843
stockholm 2295
entirely 2033
fixed-price 6149
el 5943
en 8455
prompted 1349
challenged 8075
ed 3273
kane 5783
ec 5941
bradley 5432
wrap 8310
fires 4169
year 114
naming 5229
teams 1298
pills 5909
hand-held 7612
shown 4033
accomplish 7574
opened 1070
bullish 7668
space 647
irony 2488
hastily 8134
looking 678
rational 7513
fargo 4296
showroom 9550
receiving 593
viable 7201
shows 2545
kan. 8574
rebuilding 6461
e. 1714
defenses 6803
carr 8698
cars 644
divergence 5548
uniroyal 8009
advantages 1638
rebel 6312
carl 6381
tightening 6528
marina 4719
obligation 5794
cara 6207
marine 5710
inevitable 5411
card 4256
care 3446
milestones 1404
transition 4878
british 57
honest 8052
invitation 6806
nonprofit 5112
blind 2383
benefited 1060
bare-faced 9459
stevens 1235
omitted 4246
wedd 8124
yourself 5087
directly 1097
impossible 4841
message 595
drove 4787
tomorrow 6040
size 2124
sheep 2026
sheer 8887
sheet 1099
silent 2340
capitalize 6395
caught 2538
breed 6098
reinvestment 355
marous 8849
households 6029
dillon 9139
free-lance 4019
subsidizing 8245
friend 2342
mostly 3034
that 93
pittsburgh 3810
brains 7621
taxation 5650
eliminated 4108
peck 2452
interbank 1636
professionals 4706
television 1416
underwritten 7932
tangible 7810
recruit 3195
optimism 2766
monopolies 6059
apples 5919
happy 4428
respectability 7340
troublesome 4576
contentious 7755
investors 410
remained 4391
craig 7981
correction 9354
premier 4671
bugs 2038
13th 8264
investment-grade 6034
cananea 8329
distorted 2546
anger 2837
breakfast 627
recover 5504
windsor 9272
offering 1631
veteran 5212
manufacturers 568
equipment 1167
mr. 39
batman 7256
objective 4027
swelled 6871
begin 983
scaring 5577
price 1061
neatly 8911
rationale 8865
america 3410
manville 7346
forever 7203
egg 6999
reform 2846
implications 3180
neuberger 5528
n.m. 2868
professional 3398
typically 418
filing 1136
lows 8024
jewelers 9509
german 3576
finkelstein 8825
discovered 3052
massage 9748
fletcher 8610
maine 5677
fifth 696
geography 2820
upgrade 7267
ratio 7811
title 3435
proportion 5911
jolt 7634
overruns 964
only 387
one-half 8011
sierra 4095
interstate 3239
samuel 3850
charities 5110
loath 7124
leon 6563
leather 6196
fromstein 7
market-makers 5985
losers 6827
prosecutions 9045
husband 2433
salomon 4792
concert 6620
burst 8131
bellwether 5790
elected 449
namely 5097
actively 4769
sport 6767
concern 1335
colgate 8986
suspects 2877
justifies 8506
between 757
import 2001
justified 5837
notice 3372
jacobs 6382
blame 8406
article 2023
perceptions 4699
installation 8107
outflows 8261
hypoglycemia 9173
enabling 4308
comex 9117
buy-back 3813
wheels 4488
comes 2722
nearby 4513
jeans 6996
exploit 4779
looms 7982
learning 2889
moreover 1116
oliver 3491
cycling 8079
environmentalism 9271
rebuild 6519
informed 7510
dictator 8991
dangers 8496
systems 493
wonderful 9682
shortages 5717
pesticide 9480
observers 4863
external 1385
stems 7658
suspected 6924
skiers 9914
realities 6590
developing 1376
these 318
handicapped 9186
steinberg 6107
lire 6958
editorial 2179
joke 8855
exercisable 4344
zenith 4843
determination 9312
soil 6912
metric 3128
health-care 7090
canceled 8606
bias 3451
heels 7219
return 676
floating 7993
worry 2043
develop 3382
media 3297
pretrial 9049
food 630
inquiry 3449
angered 4422
document 3333
noble 5422
investigated 8210
centuries 8670
arctic 8582
foam 3757
vista 9718
respected 5286
fruit 7654
thornburgh 7125
racketeering 7370
tradition 2592
complained 1363
theater 9083
charges 2264
constitutional 5298
phelan 4373
severe 5032
congressmen 4408
alleviate 6515
coordinate 6084
laboratories 5753
charged 3213
taxi 9196
livestock 5386
knowledgeable 4005
superconductors 5757
valuable 5357
sweeping 1702
cambodia 7505
ounces 3678
touch 3542
speed 907
renewed 2242
staging 8958
thinking 2352
desktop 1433
lender 2731
treatment 675
republic 8459
struck 7571
malcolm 1230
disproportionate 4176
real 2306
conferees 6323
nielsen 3704
spectacular 5269
read 2041
lipper 9330
pse 6782
early 182
listening 6617
pesetas 9043
using 107
execution 5331
lady 2989
rear 3848
ruled 1024
espectador 9301
tokyo-based 8938
fortune 643
heightened 4209
pounds 3876
suppliers 1990
annually 1471
benefit 5132
occasions 7115
output 1503
downward 4029
endorsed 2226
twelve 8864
exposed 77
mcgraw-hill 1970
privatization 9042
eddie 6625
intend 5169
oakland 6726
recorded 723
hepatitis 9905
conservative 4943
dealership 7145
deficit 686
recorder 5488
wheat 5382
business 1088
sixth 1686
chefs 665
balked 2232
tuition 9411
credits 778
hectic 9515
inherent 5732
exciting 2350
throw 6777
comparison 6359
central 2230
gillette 7735
sri 8920
parsow 9993
boesky 9564
wolf 6111
greatly 2872
testimony 6905
intent 3133
backup 8622
heavy 804
outlook 4596
protests 4683
tritium 9879
devoe 9921
friday-the-13th 8999
involvement 5891
shipbuilding 6280
dearborn 8467
operator 3305
shrinking 5714
your 2507
intervention 1690
dentsu 9087
prepare 2999
area 305
assumed 4248
minn. 7044
stark 3615
los 3647
low 1982
stars 580
assumes 8472
jones 3903
rjr 7824
pitches 3809
know-how 8150
two-thirds 4117
pitched 9228
trying 729
hire 3354
fraud 2655
circulation 768
stanford 2068
default 530
break-even 8442
rhone-poulenc 9803
richfield 9149
builders 5102
trustcorp 8792
arabs 8665
describe 1160
moved 982
sales 501
aftershocks 8016
enserch 9873
moves 3216
hospitals 2201
unwelcome 6794
credibility 2670
storage 6521
foothills 7104
valid 7011
gambling 5543
you 316
forcing 2705
poor 1038
suites 9536
unocal 7929
peat 8146
carpenter 8213
computerized 492
peak 2292
coverage 5434
pool 989
hambrecht 7835
fiscal 3314
pearce 8663
repay 6493
restored 5428
overseas 438
brawer 9812
blue-chip 5562
ru-486 8407
giorgio 9401
monte 7178
surrounded 8810
pointing 3755
splitting 8647
month 1028
bullion 9197
unrest 7444
deadline 3883
douglas 1232
revoke 9522
duty-free 1525
carpet 6976
referring 3463
pledged 6338
wyoming 7807
foster 4353
dominated 5213
goodson 9778
confidential 3385
homes 1966
very 176
chiron 8763
supercomputer 1087
mph 6776
decide 1198
louis 3173
mild 8686
transcanada 8588
mile 7537
bristol-myers 8540
benjamin 9081
streets 2330
greenspan 9015
wisconsin 7207
attributable 8949
casual 8752
bass 1489
abundant 8268
consumers 2211
investing 1293
labels 5902
induce 6405
witnesses 3077
certificates 4313
learned 2175
multinational 6272
turmoil 4647
iran 8998
loose 2453
modify 2286
answers 2807
tracks 3250
selective 6838
gramm-rudman 7050
kronor 9267
excess 1568
iras 4340
spielvogel 2214
strong 1048
arena 9704
conviction 3074
inspired 2834
losses 3286
exceptionally 2019
fired 2167
amount 997
advertising 735
pro-life 9928
family 2258
mediator 8566
panamanian 7890
requiring 3845
cosmetic 3920
thatcher 6810
ask 1373
analyzing 8529
aimed 3120
trained 1301
toys 940
chunks 6544
spawned 8624
conventional 3721
khan 6952
takes 2356
bipartisan 7517
usair 9579
one-day 4405
contains 3137
almost 277
epicenter 8304
taken 2442
injury 1541
diversification 4900
authorization 7864
lowering 4011
erode 3643
fast-food 2202
jr. 900
marks 1685
site 7490
instrumental 5890
excuse 7481
broke 3037
underwriter 5802
lazard 8432
mounted 3412
producing 1508
sovereignty 8701
weighed 3943
mixte 7925
veterans 9007
coalition 7689
nebraska 5374
nine 663
budgets 7334
broad-based 5527
beefeater 9961
history 1405
hhs 3172
adviser 902
pushed 5214
phrase 4630
lacks 5067
f. 1457
firmly 6258
processors 1170
ratified 5341
hampered 3193
reject 4053
idaho 7913
tried 2618
